# --------------------------------------------------------------------------------------------------
# Simple, modern, secure file encryption
brew "age"
# --------------------------------------------------------------------------------------------------
# GitHub command-line tool
brew "gh"
# --------------------------------------------------------------------------------------------------
# Task runner / simpler Make alternative written in Go
tap "go-task/tap"
brew "go-task/tap/go-task"
# --------------------------------------------------------------------------------------------------
# Kubernetes package manager
brew "helm"
# --------------------------------------------------------------------------------------------------
# Deploy Kubernetes Helm Charts
brew "helmfile"
# --------------------------------------------------------------------------------------------------
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# --------------------------------------------------------------------------------------------------
# Colorize your kubectl output
brew "kubecolor"
# --------------------------------------------------------------------------------------------------
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# --------------------------------------------------------------------------------------------------
# Kubernetes command-line interface
brew "kubernetes-cli"
# --------------------------------------------------------------------------------------------------
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# --------------------------------------------------------------------------------------------------
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# --------------------------------------------------------------------------------------------------
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# --------------------------------------------------------------------------------------------------
# Editor of encrypted files
brew "sops"
# --------------------------------------------------------------------------------------------------
# Tail multiple Kubernetes pods & their containers
brew "stern"
# --------------------------------------------------------------------------------------------------
# Linter for YAML files
brew "yamllint"
# --------------------------------------------------------------------------------------------------
